[
  {
    "name": "Juicefast",
    "category": "FOODTECH PLATFORM",
    "img": "/juicefast.jpg",
    "url": "https://juicefast.com",
    "description": "The challenge was to build a macronutrients logging app with AI-powered food recognition. Our solution was to use Expo for cross-platform development, Convex for real-time database synchronization, and Vercel's AI SDK to extract macronutrients from food photos. The app also features healthy recipes and mind & exercise videos."
  },
  {
    "name": "EdureteAI",
    "category": "EDTECH PLATFORM",
    "img": "/edurete.jpg",
    "url": "https://ai.edurete.com",
    "description": "The challenge was to create a chatbot arena-style platform for comparing multiple LLMs to facilitate math and science education. Our solution was to use Next.js with Vercel's AI SDK to leverage various language models. App is hosted on Vercel for seamless deployment and scalability."
  },
  {
    "name": "Smartell",
    "category": "MEDIA COMPANY",
    "img": "/smartell.jpg",
    "url": "https://smartell.tv",
    "description": "The challenge was to build a dynamic and engaging media website. Our solution was to use Next.js with Payload CMS for flexible content management. Smooth, captivating animations were crafted using GSAP to enhance the user experience."
  },
  {
    "name": "Croatian Screenwriters & Playwrights Guild",
    "category": "ARTISTS GUILD",
    "img": "/spid.jpg",
    "url": "https://spid.com.hr",
    "description": "The challenge was to design and build an elegant informational website. Our solution was to use Next.js as the frontend and storyblok CMS as the headless backend in order to serve a clean and simple information architecture."
  },
  {
    "name": "Infodesign",
    "category": "SOFTWARE COMPANY",
    "img": "/infodesign.jpg",
    "url": "https://infodesign.hr",
    "description": "The challenge was to showcase services and expertise of the business. Our solution was to use Progress Sitefinity CMS and a custom design system based on Bootstrap to create an aesthetically pleasing corporate website."
  },
  {
    "name": "144",
    "category": "MARKETING AGENCY",
    "img": "/144.jpg",
    "url": "https://144.hr",
    "description": "The challenge was to redesign their website to better showcase their work and services. Our solution was to use Nuxt on the frontend toghther with markdown. Key differentiation was using canvas shader animation."
  },
  {
    "name": "Jašaragić, Mamut and Stojan",
    "category": "LAW FIRM",
    "img": "/jms.jpg",
    "url": "https://jms.hr",
    "description": "The challenge was to create a modern and professional website for the law firm. Our solution was to use WordPress as the CMS with a custom theme built from scratch. The design focused on cleanliness, simplicity and trustworthiness."
  },
  {
    "name": "Tire Calligraphy",
    "category": "LIFESTYLE BRAND",
    "img": "/tirecalli.jpg",
    "url": "https://tirecalli.com",
    "description": "The challenge was to create an online presence for the fashion brand. Our solution was to use a static website with a focus on showcasing the beautiful garments. The design had a minimalist aesthetic to match the brand. As the complexity grew, we opted for Astro framework enabling us to inject React where needed."
  },
  {
    "name": "Kuk Sul Do",
    "category": "MARTIAL ARTS SCHOOL",
    "img": "/ksd.jpg",
    "url": "https://ksdzagreb.com",
    "description": "The challenge was to create a website for the martial arts school that would attract new students. Our solution was to use a simple HTML/CSS/JS static website. The design focused on showcasing the benefits of martial arts practice for both physical and mental health."
  },
  {
    "name": "Tring Energetika",
    "category": "ENERGY COMPANY",
    "img": "/tring.jpg",
    "url": "https://tring-energetika.hr",
    "description": "The challenge was to create a B2B website for an energy company. Our solution was to build a classic one pager using WordPress as the CMS in combination with Elementor for rapid page building. The design focused on simplicity and professionalism to convey credibility."
  },
  {
    "name": "Rigeta",
    "category": "MEAT PRODUCTION COMPANY",
    "img": "/rigeta.jpg",
    "url": "https://rigeta.hr",
    "description": "The challenge was to create an online presence for a meat production company. Our solution was to build a WordPress website with a custom theme built from scratch. The design focused on showcasing the high-quality products and modern production methods."
  },
  {
    "name": "Župić i partneri",
    "category": "LAW FIRM",
    "img": "/zupicpartneri.jpg",
    "url": "https://zupicipartneri.hr",
    "description": "The challenge was to create a representable website for the law firm. Our solution was to use WordPress as the CMS and customize a given theme. The design embodies a sense of purity, minimalism, and reliability in order to communicate the firm's expertise and professionalism."
  }
]